// Next.js API route support: https://nextjs.org/docs/api-routes/introduction
import type { NextApiRequest, NextApiResponse } from "next";

const fs = require("fs");
export const postBody = {
  mainImage: "/images/posts/post_main_image.png",
  tags:["بيع المنتجات" , "استرتيجيات" , "تسويق"],
  sections: [
    {
      id: 0,
      content: [
        "تحقيق وفورات في تكاليف الإعداد والتشغيل. لست بحاجة إلى استئجار مبانٍ في الشوارع الرئيسية أو الدفع لموظفين في المتجر أو الإجابة على الكثير من استفسارات ما قبل البيع.",
        "تكاليف أقل وجهد غير مذكور: إن كنت صاحب محل تجاري، فبالتأكيد يجب عليك دفع الإيجار أو الضرائب، وإن كنت مُشتري فإن تكاليف الوصول للسوق والجهد المبذول للحصول على ما تريد يكاد يكون معدومًا. لا توجد طوابير انتظار ومن خلال البيع أونلاين يمكنك ممارسة عملية البيع والشراء طوال الأسبوع ولمدة 24 ساعة. هذا يعكس ايجابيًا على البائع والمشتري.",
        "التنافس مع الشركات الكبيرة: كل ما عليك هو التميز بالطرح والأسلوب.",
      ],
    },
    {
      id: 1,
      content: [
        "التنافس مع الشركات الكبيرة: كل ما عليك هو التميز بالطرح والأسلوب.",
        "تكاليف أقل وجهد غير مذكور: إن كنت صاحب محل تجاري، فبالتأكيد يجب عليك دفع الإيجار أو الضرائب، وإن كنت مُشتري فإن تكاليف الوصول للسوق والجهد المبذول للحصول على ما تريد يكاد يكون معدومًا. لا توجد طوابير انتظار ومن خلال البيع أونلاين يمكنك ممارسة عملية البيع والشراء طوال الأسبوع ولمدة 24 ساعة. هذا يعكس ايجابيًا على البائع والمشتري.",
        "تحقيق وفورات في تكاليف الإعداد والتشغيل. لست بحاجة إلى استئجار مبانٍ في الشوارع الرئيسية أو الدفع لموظفين في المتجر أو الإجابة على الكثير من استفسارات ما قبل البيع.",
        "توفير بوابة دفع آمنة: إن توفير بوابة دفع آمنة للعملاء يساعدك على زيادة مبيعاتك وبالتالي الحصول على أرباح إضافية. كما أنك تُسهِّل على العملاء الشراء بضغطة زر وذلك لأن بعض بوابات الدفع الإلكتروني مثل",
      ],
      title: "مزايا الشراء عبر الانترنت",
    },
    {
      id: 1,
      content: [
        "التنافس مع الشركات الكبيرة: كل ما عليك هو التميز بالطرح والأسلوب.",
        "تكاليف أقل وجهد غير مذكور: إن كنت صاحب محل تجاري، فبالتأكيد يجب عليك دفع الإيجار أو الضرائب، وإن كنت مُشتري فإن تكاليف الوصول للسوق والجهد المبذول للحصول على ما تريد يكاد يكون معدومًا. لا توجد طوابير انتظار ومن خلال البيع أونلاين يمكنك ممارسة عملية البيع والشراء طوال الأسبوع ولمدة 24 ساعة. هذا يعكس ايجابيًا على البائع والمشتري.",
        "تحقيق وفورات في تكاليف الإعداد والتشغيل. لست بحاجة إلى استئجار مبانٍ في الشوارع الرئيسية أو الدفع لموظفين في المتجر أو الإجابة على الكثير من استفسارات ما قبل البيع.",
        "توفير بوابة دفع آمنة: إن توفير بوابة دفع آمنة للعملاء يساعدك على زيادة مبيعاتك وبالتالي الحصول على أرباح إضافية. كما أنك تُسهِّل على العملاء الشراء بضغطة زر وذلك لأن بعض بوابات الدفع الإلكتروني مثل",
      ],
      title: "ما فوائد البيع على الانترنت",
      image: "/images/posts/post_secondary_image.png",
    },
  ],
  comments: [
    {
      id: 1,
      name: "أحمد عبد العزيز",
      image: "/images/avatars/avatar_1.png",
      createdAt: "1-9-2020",
      content:"حرصنا من تمكين التجار من التسويق بشكل قوي وبأدوات سهلة وبسيطة. حيث يمكنك عمل حملات تسويقية وإرسالها للعملاء مع تحديد الشريحة المستهدفة بإحترافية وسهولة حرصنا من تمكين التجار من التسويق بشكل قوي وبأدوات سهلة وبسيطة. حيث يمكنك عمل حملات تسويقية وإرسالها للعملاء "
    },
    {
      id: 2,
      name: "أحمد عبد العزيز",
      createdAt: "1-9-2021",
      content:"حرصنا من تمكين التجار من التسويق بشكل قوي وبأدوات سهلة وبسيطة. حيث يمكنك عمل حملات تسويقية وإرسالها للعملاء مع تحديد الشريحة المستهدفة بإحترافية وسهولة حرصنا من تمكين التجار من التسويق بشكل قوي وبأدوات سهلة وبسيطة. حيث يمكنك عمل حملات تسويقية وإرسالها للعملاء "
    },
    {
      id: 3,
      name: "أحمد عبد العزيز",
      createdAt: "1-6-2022",
      content:"حرصنا من تمكين التجار من التسويق بشكل قوي وبأدوات سهلة وبسيطة. حيث يمكنك عمل حملات تسويقية وإرسالها للعملاء مع تحديد الشريحة المستهدفة بإحترافية وسهولة حرصنا من تمكين التجار من التسويق بشكل قوي وبأدوات سهلة وبسيطة. حيث يمكنك عمل حملات تسويقية وإرسالها للعملاء "
    }
  ],
};

export const posts = [
  {
    author: "عبدالله عادل",
    title: " ما هو مستقبل التجارة الإلكترونية ",
    excerpt:
      "من المتوقع أن تزيد المبيعات من 1.3 تريليون في عام 2014 إلى 4.5 تريليون في عام 2021",
    category: "التقارير والدراسات",
    subcategory: "أفكار البزنس",
    created_at: "2019-01-30T12:00:00.000Z",
    id: 2,
    tags: ["#تسويق", "#استراتيجيات", "#بيع المنتجات"],
    is_featured: false,
    image: "/images/posts/2.png",
    slug: "consequatur-facilis-minus",
  },
  {
    author: "عبدالله عادل",
    title: " ما هو مستقبل التجارة الإلكترونية ",
    excerpt:
      "من المتوقع أن تزيد المبيعات من 1.3 تريليون في عام 2014 إلى 4.5 تريليون في عام 2021",
    category: "التقارير والدراسات",
    subcategory: "أفكار البزنس",
    created_at: "2019-01-30T12:00:00.000Z",
    id: 3,
    tags: ["#تسويق", "#استراتيجيات", "#بيع المنتجات"],
    is_featured: false,
    image: "/images/posts/3.png",
    slug: "sequi-ut-reiciendis",
  },
  {
    author: "عبدالله عادل",
    title: " ما هو مستقبل التجارة الإلكترونية ",
    excerpt:
      "من المتوقع أن تزيد المبيعات من 1.3 تريليون في عام 2014 إلى 4.5 تريليون في عام 2021",
    category: "التقارير والدراسات",
    subcategory: "أفكار البزنس",
    created_at: "2019-01-30T12:00:00.000Z",
    id: 4,
    tags: ["#تسويق", "#استراتيجيات", "#بيع المنتجات"],
    is_featured: false,
    image: "/images/posts/4.png",
    slug: "quos-fugiat-illo",
  },
  {
    author: "عبدالله عادل",
    title: " ما هو مستقبل التجارة الإلكترونية ",
    excerpt:
      "من المتوقع أن تزيد المبيعات من 1.3 تريليون في عام 2014 إلى 4.5 تريليون في عام 2021",
    category: "التقارير والدراسات",
    subcategory: "أفكار البزنس",
    created_at: "2019-01-30T12:00:00.000Z",
    id: 5,
    tags: ["#تسويق", "#استراتيجيات", "#بيع المنتجات"],
    is_featured: false,
    image: "/images/posts/5.png",
    slug: "autem-aut-ut",
  },
  {
    author: "عبدالله عادل",
    title: " ما هو مستقبل التجارة الإلكترونية ",
    excerpt:
      "من المتوقع أن تزيد المبيعات من 1.3 تريليون في عام 2014 إلى 4.5 تريليون في عام 2021",
    category: "التقارير والدراسات",
    subcategory: "أفكار البزنس",
    created_at: "2019-01-30T12:00:00.000Z",
    id: 6,
    tags: ["#تسويق", "#استراتيجيات", "#بيع المنتجات"],
    is_featured: false,
    image: "/images/posts/6.png",
    slug: "alias-facere-sapiente",
  },
  {
    author: "عبدالله عادل",
    title: " ما هو مستقبل التجارة الإلكترونية ",
    excerpt:
      "من المتوقع أن تزيد المبيعات من 1.3 تريليون في عام 2014 إلى 4.5 تريليون في عام 2021",
    category: "التقارير والدراسات",
    subcategory: "أفكار البزنس",
    created_at: "2019-01-30T12:00:00.000Z",
    id: 7,
    tags: ["#تسويق", "#استراتيجيات", "#بيع المنتجات"],
    is_featured: false,
    image: "/images/posts/7.png",
    slug: "ipsum-consequatur-eos",
  },
  {
    author: "عبدالله عادل",
    title: " ما هو مستقبل التجارة الإلكترونية ",
    excerpt:
      "من المتوقع أن تزيد المبيعات من 1.3 تريليون في عام 2014 إلى 4.5 تريليون في عام 2021",
    category: "التقارير والدراسات",
    subcategory: "أفكار البزنس",
    created_at: "2019-01-30T12:00:00.000Z",
    id: 8,
    tags: ["#تسويق", "#استراتيجيات", "#بيع المنتجات"],
    is_featured: false,
    image: "/images/posts/8.png",
    slug: "non-non-dignissimos",
  },
  {
    author: "عبدالله عادل",
    title: " ما هو مستقبل التجارة الإلكترونية ",
    excerpt:
      "من المتوقع أن تزيد المبيعات من 1.3 تريليون في عام 2014 إلى 4.5 تريليون في عام 2021",
    category: "التقارير والدراسات",
    subcategory: "أفكار البزنس",
    created_at: "2019-01-30T12:00:00.000Z",
    id: 9,
    tags: ["#تسويق", "#استراتيجيات", "#بيع المنتجات"],
    is_featured: false,
    image: "/images/posts/9.png",
    slug: "voluptatem-impedit-ipsam",
  },
  {
    author: "عبدالله عادل",
    title: " ما هو مستقبل التجارة الإلكترونية ",
    excerpt:
      "من المتوقع أن تزيد المبيعات من 1.3 تريليون في عام 2014 إلى 4.5 تريليون في عام 2021",
    category: "التقارير والدراسات",
    subcategory: "أفكار البزنس",
    created_at: "2019-01-30T12:00:00.000Z",
    id: 10,
    tags: ["#تسويق", "#استراتيجيات", "#بيع المنتجات"],
    is_featured: true,
    image: "/images/featured_post.png",
    slug: "dolorum-tempore-et",
  },
];

export interface Post {
  author: string;
  title: string;
  excerpt: string;
  category: string;
  subcategory: string;
  created_at: string;
  id: number;
  tags: string[];
  is_featured: boolean;
  image: string;
  slug: string;
  body?: {
    mainImage: string;
    sections: Section[];
  };
}

export interface Section {
  content: string[];
  title?: string;
  image?: string;
  id: number;
  tags:string[];
  comments?:Comment[];
}

export interface Comment{
  id:number;
  name:string;
  content:string;
  created_at:string;
}

type Data = {
  most_read: Post[];
  posts: Post[];
};

export default async function handler( // Generated by https://quicktype.io
  req: NextApiRequest,
  res: NextApiResponse<Data>
) {
  // await new Promise((resolve) => setTimeout(resolve, 1000));
  res.status(200).json({ most_read: posts, posts });
}
